<script lang="ts">
    let { onClose }: { onClose: () => void } = $props();
</script>

<div class="shadow">
	<div class="modal">
			<button class="close_modal" onclick={onClose}>
				<svg width="33" height="24" viewBox="0 0 33 24" fill="none" xmlns="http://www.w3.org/2000/svg">
					<path d="M10 1.66666L1.875 8.33332L10 15" stroke="#EB7445" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
					<path d="M1.875 8.33331H14.875C23.8499 8.33331 31.125 14.3026 31.125 21.6666V23" stroke="#EB7445" stroke-width="2" stroke-linecap="round" stroke-linejoin="round"/>
					</svg>					
					<p class="back">Назад</p>
			</button>
		<p class="hd">
            Правила игры
        </p>
        <svg class="line" width="347" height="1" viewBox="0 0 347 1" fill="none" xmlns="http://www.w3.org/2000/svg">
            <line y1="0.5" x2="347" y2="0.5" stroke="url(#paint0_linear_22_10)"/>
            <defs>
            <linearGradient id="paint0_linear_22_10" x1="0" y1="1.5" x2="347" y2="1.5" gradientUnits="userSpaceOnUse">
            <stop stop-color="#EB7445" stop-opacity="0"/>
            <stop offset="0.545" stop-color="#EB7445"/>
            <stop offset="1" stop-color="#EB7445" stop-opacity="0"/>
            </linearGradient>
            </defs>
            </svg>
            <main>
        <p class="text">Первый ход.
            Первый ход начинается с приобретения карт для защиты своих
            объектов, покупать карты для атаки соперников на первом ходу не
            допускается.
            Для покупки карт пользователь должен кликнуть на один из своих
            объектов, выбирать одну из предложенных карт и нажать на нее. Каждая
            карта имеет свою стоимость. При выборе карты ее стоимость будет
            автоматически списана из ваших денег и приобретется карта. Каждая карта
            имеет свой срок действия, выраженный в количестве ходов. Рядом с каждым
            объектом есть поле, где указанно, какие карты для этого объекта сейчас
            активны, а какие теряют свои возможности (состояние карт показано
            яркостью их картинки в поле).
            Для завершения своего хода игрок должен нажать на кнопку
            «закончить ход». После нажатия на кнопку «закончить ход» игрок не может
            больше покупать карты, он ожидает окончания хода соперников.
            По окончании времени первого хода или завершению хода всеми
            игроками, происходит общая атака на всех (случайное событие).
            Следующие ходы.
            Перед началом каждого последующего хода игрокам зачисляется
            фиксированная сумма в 2000 рублей. Если на предыдущем ходу игрок провел
            успешную атаку на объект соперника или удачно отразил атаку на свои
            объекты, то к основной сумме прибавляется еще 1000 рублей за каждую
            успешную атаку или защиту.
            На каждом последующем ходу (после первого) можно выбирать любые
            карты для покупки в рамках бюджета игрока. К покупке доступно не более
            трех карт атаки или защиты. Так же есть возможность обновить уже
            имеющиеся каты (количество не ограничено).
             </p>
             <p class="text">
                Для приобретения карт атаки необходимо кликнуть на объект
конкретного соперника, выбрать карту и нажать на нее. Автоматически
спишутся деньги, равные ее стоимости. После приобретения карта будет
отображена под соответствующим объектом соперника.
Победителем игры становится тот игрок, который сможет сохранить
очки ХП на всех своих защищаемых объектах до конца игры.
Игрок считается проигравшим, если у него хоть на одном из
защищаемых объектов закончатся очки ХП.
Игрок в любой момент игры может нажать на кнопку «сдаться». Он
автоматически считается проигравшим и переходит в режим наблюдателя.
При нажатии на кнопку «правила игры» открывается страница с
правилами игры, там же прописаны события и их логика. Для возвращения в
главное меню пользователь должен нажать кнопку «назад».
Случайные события.
Во время игры могут происходить случайные события. Они могут
возникнуть между или во время ходов, и влияют на ход игры. Например,
могут не позволить игрокам атаковать или защищаться.
При возникновении случайного события на игровом поле появляется
уведомление с его описанием. Для того чтобы его убрать, необходимо
кликнуть в любой части экрана или на кнопку для продолжения игры на окне
уведомления.
             </p>
            </main>
	</div>
</div>

<style>
    main {
        display: grid;
        grid-template-columns: 1fr 1fr;
    }
    	.hd {
		font-weight: bold;
        margin: 20px 0 10px 0;
		font-style:italic;
		font-size: 24px;
		color: #2C4194;
		font-weight: 900;
		position: relative;
	}
    .text {
        font-weight: bold;
        color: #2C4194;
        font-style: italic;
        text-align: center;
        font-weight: 900;
        font-size: 20px;
    }
    .shadow {
		position: absolute;
		top: 0;
		bottom: 0;
		left: 0;
		right: 0;
		background: rgba(0, 0, 0, 0.1);
		z-index: 100;
		display: flex;
		align-items: center;
		justify-content: center;
		backdrop-filter: blur(30px);
        padding: 72px;
	}

	.modal {
		z-index: 101;
		background: white;
		display: flex;
		flex-direction: column;
		padding-left: 40px;
		padding-right: 40px;
		border-radius: 20px;
		align-items: center;
		justify-content: center ;
		
	}
    .close_modal{
		cursor: pointer;
		border: none;
		background: none;
		position: relative;
		right: 800px;
		top: 20px;
		display: flex;
		}
	.back{
		color: #EB7445;
		 font-size: 16px ;
		  margin-left: 10px;
		  cursor: pointer;
	}
    .line {
		position: relative;
        margin-bottom: 20px;
}
</style>